Revit 2027 API
ParameterTypeId.ViewportSheetName Property
 "Sheet Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewportSheetName { get; }
Public Shared ReadOnly Property ViewportSheetName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewportSheetName {
	ForgeTypeId^ get ();
}
static member ViewportSheetName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace